## Plan Result (543: stg_appgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw"
        name                              = "aks-fe-00-stg-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/vh-admin-web" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendAddressPools/vh-video-web" -> null
          - ip_addresses = [
              - "10.148.15.250",
              - "10.148.31.250",
            ] -> null
          - name         = "vh-video-web" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/c100-application" -> null
          - name                                = "c100-application" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/c100-application" -> null
          - probe_name                          = "c100-application" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/darts-portal" -> null
          - name                                = "darts-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/darts-portal" -> null
          - probe_name                          = "darts-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/juror-bureau" -> null
          - name                                = "juror-bureau" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/juror-bureau" -> null
          - probe_name                          = "juror-bureau" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/juror-public" -> null
          - name                                = "juror-public" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/juror-public" -> null
          - probe_name                          = "juror-public" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/opal-frontend" -> null
          - name                                = "opal-frontend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/opal-frontend" -> null
          - probe_name                          = "opal-frontend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/opal-frontend-test" -> null
          - name                                = "opal-frontend-test" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/opal-frontend-test" -> null
          - probe_name                          = "opal-frontend-test" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pip-frontend" -> null
          - name                                = "pip-frontend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pip-frontend" -> null
          - probe_name                          = "pip-frontend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pip-frontend-b2c-sign-in" -> null
          - name                                = "pip-frontend-b2c-sign-in" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pip-frontend-b2c-sign-in" -> null
          - probe_name                          = "pip-frontend-b2c-sign-in" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pip-frontend-b2c-staff" -> null
          - name                                = "pip-frontend-b2c-staff" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pip-frontend-b2c-staff" -> null
          - probe_name                          = "pip-frontend-b2c-staff" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/portal-stg" -> null
          - name                                = "portal-stg" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/portal-stg" -> null
          - probe_name                          = "portal-stg" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/pre-portal" -> null
          - name                                = "pre-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/pre-portal" -> null
          - probe_name                          = "pre-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/sds-api-mgmt" -> null
          - name                                = "sds-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/sds-api-mgmt" -> null
          - probe_name                          = "sds-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-casetracker" -> null
          - name                                = "staging-casetracker" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-casetracker" -> null
          - probe_name                          = "staging-casetracker" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-certificatedbailiffs" -> null
          - name                                = "staging-certificatedbailiffs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-certificatedbailiffs" -> null
          - probe_name                          = "staging-certificatedbailiffs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-courtfines" -> null
          - name                                = "staging-courtfines" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-courtfines" -> null
          - probe_name                          = "staging-courtfines" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-immigrationappealsonline" -> null
          - name                                = "staging-immigrationappealsonline" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/probes/staging-immigrationappealsonline" -> null
          - probe_name                          = "staging-immigrationappealsonline" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-stg-agw/backendHttpSettingsCollection/staging-trib-admin-appeals" -> null
      

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

         + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-bureau"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-bureau"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-bureau"
          + id                          = (known after apply)
          + name                        = "juror-bureau"
          + priority                    = 260
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-public"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-public"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-public"
          + id                          = (known after apply)
          + name                        = "juror-public"
          + priority                    = 250
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-frontend"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-frontend"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-frontend"
          + id                          = (known after apply)
          + name                        = "opal-frontend"
          + priority                    = 270
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "opal-frontend-test"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "opal-frontend-test"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "opal-frontend-test"
          + id                          = (known after apply)
          + name                        = "opal-frontend-test"
          + priority                    = 280
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "portal-stg"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "portal-stg"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "portal-stg"
          + id                          = (known after apply)
          + name                        = "portal-stg"
          + priority                    = 230
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-portal"
          + id                          = (known after apply)
          + name                        = "pre-portal"
          + priority                    = 70
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sds-api-mgmt"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sds-api-mgmt"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sds-api-mgmt"
          + id                          = (known after apply)
          + name                        = "sds-api-mgmt"
          + priority                    = 120
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-casetracker"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-casetracker"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-casetracker"
          + id                          = (known after apply)
          + name                        = "staging-casetracker"
          + priority                    = 80
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-certificatedbailiffs"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-certificatedbailiffs"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-certificatedbailiffs"
          + id                          = (known after apply)
          + name                        = "staging-certificatedbailiffs"
          + priority                    = 90
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-courtfines"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-courtfines"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-courtfines"
          + id                          = (known after apply)
          + name                        = "staging-courtfines"
          + priority                    = 100
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-immigrationappealsonline"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-immigrationappealsonline"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-immigrationappealsonline"
          + id                          = (known after apply)
          + name                        = "staging-immigrationappealsonline"
          + priority                    = 110
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-admin-appeals"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-admin-appeals"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-admin-appeals"
          + id                          = (known after apply)
          + name                        = "staging-trib-admin-appeals"
          + priority                    = 160
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-care-standards"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-care-standards"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-care-standards"
          + id                          = (known after apply)
          + name                        = "staging-trib-care-standards"
          + priority                    = 170
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-cicap"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-cicap"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-cicap"
          + id                          = (known after apply)
          + name                        = "staging-trib-cicap"
          + priority                    = 220
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-employment-appeals"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-employment-appeals"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-employment-appeals"
          + id                          = (known after apply)
          + name                        = "staging-trib-employment-appeals"
          + priority                    = 200
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-finance-tax"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-finance-tax"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-finance-tax"
          + id                          = (known after apply)
          + name                        = "staging-trib-finance-tax"
          + priority                    = 190
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-immigration-svcs"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-immigration-svcs"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-immigration-svcs"
          + id                          = (known after apply)
          + name                        = "staging-trib-immigration-svcs"
          + priority                    = 140
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-info-rights"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-info-rights"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-info-rights"
          + id                          = (known after apply)
          + name                        = "staging-trib-info-rights"
          + priority                    = 150
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-land-reg-division"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-land-reg-division"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-land-reg-division"
          + id                          = (known after apply)
          + name                        = "staging-trib-land-reg-division"
          + priority                    = 130
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-lands-chamber"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-lands-chamber"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-lands-chamber"
          + id                          = (known after apply)
          + name                        = "staging-trib-lands-chamber"
          + priority                    = 180
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "staging-trib-tansport-appeals"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "staging-trib-tansport-appeals"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "staging-trib-tansport-appeals"
          + id                          = (known after apply)
          + name                        = "staging-trib-tansport-appeals"
          + priority                    = 210
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (36 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 543: stg_appgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/947/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":947,"Program":"tfcmt","SHA1":"","Target":"543: stg_appgateway - TerraformPlanApply","Vars":{}} -->